Revit 2015 API
SlabEdgeTypeSet Class
A set that contains slab edge types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public class SlabEdgeTypeSet : APIObject,
	IEnumerable
Visual Basic
Public Class SlabEdgeTypeSet _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class SlabEdgeTypeSet : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.SlabEdgeTypeSet
See Also
SlabEdgeTypeSet Members
Autodesk.Revit.DB Namespace